package org.example.Parser;

import org.example.Operation;

public class Parser implements IParser
{

    @Override
    public Operation Parse(String inputString)
    {
        // todo: реализуйте метод Parse().
        // этод метод "парсит" строку inputString и возвращает объект Operation
        // Формат строки: {имя_операции} {параметр1} ... {параметрN}
        // Обратите внимание:
        // предварительно повторяющиеся пробелы и пробелы в начале и в конце нужно игнорировать
        //
        // Если что-то пойдет не так (например, из строки нельзя выделить
        // знак операции и как минимум один параметр), не забудьте сгенерировать
        // соответствующее исключение из папки Exceptions
        //
        // Обратите внимание на юнит-тесты для этого класса


        return null;
    }
}
